{"class_name": "Model", "keras_version": "2.1.5", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "DCGAN_input", "config": {"sparse": false, "batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "name": "DCGAN_input"}}, {"class_name": "Model", "inbound_nodes": [[["DCGAN_input", 0, 0, {}]]], "name": "model_1", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 128, 128, 3], "name": "unet_input", "dtype": "float32"}, "name": "unet_input"}, {"class_name": "Conv2D", "inbound_nodes": [[["unet_input", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "name": "unet_conv2D_1", "kernel_regularizer": null, "filters": 64, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "name": "unet_conv2D_1"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["unet_conv2D_1", 0, 0, {}]]], "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_1"}, "name": "leaky_re_lu_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "name": "unet_conv2D_2", "kernel_regularizer": null, "filters": 128, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "name": "unet_conv2D_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["unet_conv2D_2", 0, 0, {}]]], "config": {"gamma_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "momentum": 0.99, "scale": true, "epsilon": 0.001}, "name": "batch_normalization_1"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_2"}, "name": "leaky_re_lu_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "name": "unet_conv2D_3", "kernel_regularizer": null, "filters": 256, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "name": "unet_conv2D_3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["unet_conv2D_3", 0, 0, {}]]], "config": {"gamma_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "momentum": 0.99, "scale": true, "epsilon": 0.001}, "name": "batch_normalization_2"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_3"}, "name": "leaky_re_lu_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "name": "unet_conv2D_4", "kernel_regularizer": null, "filters": 512, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "name": "unet_conv2D_4"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["unet_conv2D_4", 0, 0, {}]]], "config": {"gamma_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "momentum": 0.99, "scale": true, "epsilon": 0.001}, "name": "batch_normalization_3"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "name": "activation_1"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_1"}, "name": "up_sampling2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "name": "unet_upconv2D_1", "kernel_regularizer": null, "filters": 128, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "name": "unet_upconv2D_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["unet_upconv2D_1", 0, 0, {}]]], "config": {"gamma_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "momentum": 0.99, "scale": true, "epsilon": 0.001}, "name": "batch_normalization_4"}, {"class_name": "Dropout", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"rate": 0.5, "trainable": true, "seed": null, "name": "dropout_1", "noise_shape": null}, "name": "dropout_1"}, {"class_name": "Concatenate", "inbound_nodes": [[["dropout_1", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]], "config": {"trainable": true, "axis": -1, "name": "concatenate_1"}, "name": "concatenate_1"}, {"class_name": "Activation", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "name": "activation_2"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_2"}, "name": "up_sampling2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "name": "unet_upconv2D2", "kernel_regularizer": null, "filters": 64, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "name": "unet_upconv2D2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["unet_upconv2D2", 0, 0, {}]]], "config": {"gamma_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "momentum": 0.99, "scale": true, "epsilon": 0.001}, "name": "batch_normalization_5"}, {"class_name": "Dropout", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"rate": 0.5, "trainable": true, "seed": null, "name": "dropout_2", "noise_shape": null}, "name": "dropout_2"}, {"class_name": "Concatenate", "inbound_nodes": [[["dropout_2", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]], "config": {"trainable": true, "axis": -1, "name": "concatenate_2"}, "name": "concatenate_2"}, {"class_name": "Activation", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "name": "activation_3"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_3"}, "name": "up_sampling2d_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "name": "unet_upconv2D3", "kernel_regularizer": null, "filters": 64, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "name": "unet_upconv2D3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["unet_upconv2D3", 0, 0, {}]]], "config": {"gamma_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_6", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "momentum": 0.99, "scale": true, "epsilon": 0.001}, "name": "batch_normalization_6"}, {"class_name": "Dropout", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"rate": 0.5, "trainable": true, "seed": null, "name": "dropout_3", "noise_shape": null}, "name": "dropout_3"}, {"class_name": "Concatenate", "inbound_nodes": [[["dropout_3", 0, 0, {}], ["unet_conv2D_1", 0, 0, {}]]], "config": {"trainable": true, "axis": -1, "name": "concatenate_3"}, "name": "concatenate_3"}, {"class_name": "Activation", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "name": "activation_4"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_4"}, "name": "up_sampling2d_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "name": "last_conv", "kernel_regularizer": null, "filters": 3, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "name": "last_conv"}, {"class_name": "Activation", "inbound_nodes": [[["last_conv", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_5", "activation": "tanh"}, "name": "activation_5"}], "input_layers": [["unet_input", 0, 0]], "name": "model_1", "output_layers": [["activation_5", 0, 0]]}}, {"class_name": "Lambda", "inbound_nodes": [[["model_1", 1, 0, {}]]], "name": "lambda_2", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpcA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_2"}}, {"class_name": "Lambda", "inbound_nodes": [[["model_1", 1, 0, {}]]], "name": "lambda_4", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpcA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_4"}}, {"class_name": "Lambda", "inbound_nodes": [[["model_1", 1, 0, {}]]], "name": "lambda_6", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpcA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_6"}}, {"class_name": "Lambda", "inbound_nodes": [[["model_1", 1, 0, {}]]], "name": "lambda_8", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpcA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_8"}}, {"class_name": "Lambda", "inbound_nodes": [[["model_1", 1, 0, {}]]], "name": "lambda_10", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpcA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_10"}}, {"class_name": "Lambda", "inbound_nodes": [[["model_1", 1, 0, {}]]], "name": "lambda_12", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpcA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_12"}}, {"class_name": "Lambda", "inbound_nodes": [[["model_1", 1, 0, {}]]], "name": "lambda_14", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpcA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_14"}}, {"class_name": "Lambda", "inbound_nodes": [[["model_1", 1, 0, {}]]], "name": "lambda_16", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpcA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_16"}}, {"class_name": "Lambda", "inbound_nodes": [[["model_1", 1, 0, {}]]], "name": "lambda_18", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpcA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_18"}}, {"class_name": "Lambda", "inbound_nodes": [[["model_1", 1, 0, {}]]], "name": "lambda_20", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpcA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_20"}}, {"class_name": "Lambda", "inbound_nodes": [[["model_1", 1, 0, {}]]], "name": "lambda_22", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpcA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_22"}}, {"class_name": "Lambda", "inbound_nodes": [[["model_1", 1, 0, {}]]], "name": "lambda_24", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpcA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_24"}}, {"class_name": "Lambda", "inbound_nodes": [[["model_1", 1, 0, {}]]], "name": "lambda_26", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpcA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_26"}}, {"class_name": "Lambda", "inbound_nodes": [[["model_1", 1, 0, {}]]], "name": "lambda_28", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpcA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_28"}}, {"class_name": "Lambda", "inbound_nodes": [[["model_1", 1, 0, {}]]], "name": "lambda_30", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpcA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_30"}}, {"class_name": "Lambda", "inbound_nodes": [[["model_1", 1, 0, {}]]], "name": "lambda_32", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpcA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_32"}}, {"class_name": "Lambda", "inbound_nodes": [[["DCGAN_input", 0, 0, {}]]], "name": "lambda_1", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpUA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_1"}}, {"class_name": "Lambda", "inbound_nodes": [[["DCGAN_input", 0, 0, {}]]], "name": "lambda_3", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpUA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_3"}}, {"class_name": "Lambda", "inbound_nodes": [[["DCGAN_input", 0, 0, {}]]], "name": "lambda_5", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpUA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_5"}}, {"class_name": "Lambda", "inbound_nodes": [[["DCGAN_input", 0, 0, {}]]], "name": "lambda_7", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpUA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_7"}}, {"class_name": "Lambda", "inbound_nodes": [[["DCGAN_input", 0, 0, {}]]], "name": "lambda_9", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpUA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_9"}}, {"class_name": "Lambda", "inbound_nodes": [[["DCGAN_input", 0, 0, {}]]], "name": "lambda_11", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpUA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_11"}}, {"class_name": "Lambda", "inbound_nodes": [[["DCGAN_input", 0, 0, {}]]], "name": "lambda_13", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpUA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_13"}}, {"class_name": "Lambda", "inbound_nodes": [[["DCGAN_input", 0, 0, {}]]], "name": "lambda_15", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpUA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_15"}}, {"class_name": "Lambda", "inbound_nodes": [[["DCGAN_input", 0, 0, {}]]], "name": "lambda_17", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpUA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_17"}}, {"class_name": "Lambda", "inbound_nodes": [[["DCGAN_input", 0, 0, {}]]], "name": "lambda_19", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpUA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_19"}}, {"class_name": "Lambda", "inbound_nodes": [[["DCGAN_input", 0, 0, {}]]], "name": "lambda_21", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpUA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_21"}}, {"class_name": "Lambda", "inbound_nodes": [[["DCGAN_input", 0, 0, {}]]], "name": "lambda_23", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpUA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_23"}}, {"class_name": "Lambda", "inbound_nodes": [[["DCGAN_input", 0, 0, {}]]], "name": "lambda_25", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpUA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_25"}}, {"class_name": "Lambda", "inbound_nodes": [[["DCGAN_input", 0, 0, {}]]], "name": "lambda_27", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpUA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_27"}}, {"class_name": "Lambda", "inbound_nodes": [[["DCGAN_input", 0, 0, {}]]], "name": "lambda_29", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpUA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_29"}}, {"class_name": "Lambda", "inbound_nodes": [[["DCGAN_input", 0, 0, {}]]], "name": "lambda_31", "config": {"output_shape": null, "trainable": true, "arguments": {}, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAczwAAAB8AABkAABkAACFAgCIAQBkAQAZiAEAZAIAGYUCAIgA\nAGQBABmIAABkAgAZhQIAZAAAZAAAhQIAZgQAGVMpA07pAAAAAOkBAAAAqQApAdoBeikC2gdjb2xf\naWR42gdyb3dfaWR4cgMAAAD1UAAAAC9tZWRpYS9yaWt1dG8v44Oc44Oq44Ol44O844OgL+OCs+OD\nvOODiS9kZW5vaXNlX3BpeDJwaXgtbWFzdGVyKDEyOHgxMjgpL21vZGVsLnB52gg8bGFtYmRhPpUA\nAADzAAAAAA==\n", null, [[96, 128], [96, 128]]], "function_type": "lambda", "name": "lambda_31"}}, {"class_name": "Model", "inbound_nodes": [[["lambda_2", 0, 0, {}], ["lambda_4", 0, 0, {}], ["lambda_6", 0, 0, {}], ["lambda_8", 0, 0, {}], ["lambda_10", 0, 0, {}], ["lambda_12", 0, 0, {}], ["lambda_14", 0, 0, {}], ["lambda_16", 0, 0, {}], ["lambda_18", 0, 0, {}], ["lambda_20", 0, 0, {}], ["lambda_22", 0, 0, {}], ["lambda_24", 0, 0, {}], ["lambda_26", 0, 0, {}], ["lambda_28", 0, 0, {}], ["lambda_30", 0, 0, {}], ["lambda_32", 0, 0, {}], ["lambda_1", 0, 0, {}], ["lambda_3", 0, 0, {}], ["lambda_5", 0, 0, {}], ["lambda_7", 0, 0, {}], ["lambda_9", 0, 0, {}], ["lambda_11", 0, 0, {}], ["lambda_13", 0, 0, {}], ["lambda_15", 0, 0, {}], ["lambda_17", 0, 0, {}], ["lambda_19", 0, 0, {}], ["lambda_21", 0, 0, {}], ["lambda_23", 0, 0, {}], ["lambda_25", 0, 0, {}], ["lambda_27", 0, 0, {}], ["lambda_29", 0, 0, {}], ["lambda_31", 0, 0, {}]]], "name": "DCGAN_discriminator", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "dist_input0", "dtype": "float32"}, "name": "dist_input0"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "disc_raw_input0", "dtype": "float32"}, "name": "disc_raw_input0"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "dist_input1", "dtype": "float32"}, "name": "dist_input1"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "disc_raw_input1", "dtype": "float32"}, "name": "disc_raw_input1"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "dist_input2", "dtype": "float32"}, "name": "dist_input2"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "disc_raw_input2", "dtype": "float32"}, "name": "disc_raw_input2"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "dist_input3", "dtype": "float32"}, "name": "dist_input3"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "disc_raw_input3", "dtype": "float32"}, "name": "disc_raw_input3"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "dist_input4", "dtype": "float32"}, "name": "dist_input4"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "disc_raw_input4", "dtype": "float32"}, "name": "disc_raw_input4"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "dist_input5", "dtype": "float32"}, "name": "dist_input5"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "disc_raw_input5", "dtype": "float32"}, "name": "disc_raw_input5"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "dist_input6", "dtype": "float32"}, "name": "dist_input6"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "disc_raw_input6", "dtype": "float32"}, "name": "disc_raw_input6"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "dist_input7", "dtype": "float32"}, "name": "dist_input7"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "disc_raw_input7", "dtype": "float32"}, "name": "disc_raw_input7"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "dist_input8", "dtype": "float32"}, "name": "dist_input8"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "disc_raw_input8", "dtype": "float32"}, "name": "disc_raw_input8"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "dist_input9", "dtype": "float32"}, "name": "dist_input9"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "disc_raw_input9", "dtype": "float32"}, "name": "disc_raw_input9"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "dist_input10", "dtype": "float32"}, "name": "dist_input10"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "disc_raw_input10", "dtype": "float32"}, "name": "disc_raw_input10"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "dist_input11", "dtype": "float32"}, "name": "dist_input11"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "disc_raw_input11", "dtype": "float32"}, "name": "disc_raw_input11"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "dist_input12", "dtype": "float32"}, "name": "dist_input12"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "disc_raw_input12", "dtype": "float32"}, "name": "disc_raw_input12"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "dist_input13", "dtype": "float32"}, "name": "dist_input13"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "disc_raw_input13", "dtype": "float32"}, "name": "disc_raw_input13"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "dist_input14", "dtype": "float32"}, "name": "dist_input14"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "disc_raw_input14", "dtype": "float32"}, "name": "disc_raw_input14"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "dist_input15", "dtype": "float32"}, "name": "dist_input15"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "disc_raw_input15", "dtype": "float32"}, "name": "disc_raw_input15"}, {"class_name": "Model", "inbound_nodes": [[["dist_input0", 0, 0, {}], ["disc_raw_input0", 0, 0, {}]], [["dist_input1", 0, 0, {}], ["disc_raw_input1", 0, 0, {}]], [["dist_input2", 0, 0, {}], ["disc_raw_input2", 0, 0, {}]], [["dist_input3", 0, 0, {}], ["disc_raw_input3", 0, 0, {}]], [["dist_input4", 0, 0, {}], ["disc_raw_input4", 0, 0, {}]], [["dist_input5", 0, 0, {}], ["disc_raw_input5", 0, 0, {}]], [["dist_input6", 0, 0, {}], ["disc_raw_input6", 0, 0, {}]], [["dist_input7", 0, 0, {}], ["disc_raw_input7", 0, 0, {}]], [["dist_input8", 0, 0, {}], ["disc_raw_input8", 0, 0, {}]], [["dist_input9", 0, 0, {}], ["disc_raw_input9", 0, 0, {}]], [["dist_input10", 0, 0, {}], ["disc_raw_input10", 0, 0, {}]], [["dist_input11", 0, 0, {}], ["disc_raw_input11", 0, 0, {}]], [["dist_input12", 0, 0, {}], ["disc_raw_input12", 0, 0, {}]], [["dist_input13", 0, 0, {}], ["disc_raw_input13", 0, 0, {}]], [["dist_input14", 0, 0, {}], ["disc_raw_input14", 0, 0, {}]], [["dist_input15", 0, 0, {}], ["disc_raw_input15", 0, 0, {}]]], "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "discriminator_inpit", "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "name": "discriminator_inpit"}}, {"class_name": "InputLayer", "inbound_nodes": [], "name": "discriminator_raw_input", "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "name": "discriminator_raw_input"}}, {"class_name": "Conv2D", "inbound_nodes": [[["discriminator_inpit", 0, 0, {}]]], "name": "disc_conv2d_1", "config": {"padding": "same", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "name": "disc_conv2d_1", "kernel_regularizer": null, "filters": 64, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}}, {"class_name": "Conv2D", "inbound_nodes": [[["discriminator_raw_input", 0, 0, {}]]], "name": "raw_disc_conv2d_1", "config": {"padding": "same", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "name": "raw_disc_conv2d_1", "kernel_regularizer": null, "filters": 64, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["disc_conv2d_1", 0, 0, {}]]], "name": "batch_normalization_7", "config": {"gamma_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_7", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "momentum": 0.99, "scale": true, "epsilon": 0.001}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["raw_disc_conv2d_1", 0, 0, {}]]], "name": "batch_normalization_8", "config": {"gamma_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_8", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "momentum": 0.99, "scale": true, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "leaky_re_lu_4", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_4"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "leaky_re_lu_5", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_5"}}, {"class_name": "Concatenate", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}], ["leaky_re_lu_5", 0, 0, {}]]], "name": "concatenate_5", "config": {"trainable": true, "axis": -1, "name": "concatenate_5"}}, {"class_name": "Conv2D", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "name": "disc_conv2d_3", "config": {"padding": "same", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "name": "disc_conv2d_3", "kernel_regularizer": null, "filters": 256, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["disc_conv2d_3", 0, 0, {}]]], "name": "batch_normalization_10", "config": {"gamma_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_10", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "momentum": 0.99, "scale": true, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "leaky_re_lu_7", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_7"}}, {"class_name": "Flatten", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "disc_dense", "config": {"trainable": true, "activity_regularizer": null, "units": 2, "use_bias": true, "name": "disc_dense", "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax"}}], "input_layers": [["discriminator_inpit", 0, 0], ["discriminator_raw_input", 0, 0]], "name": "PatchGAN", "output_layers": [["disc_dense", 0, 0]]}, "name": "PatchGAN"}, {"class_name": "Concatenate", "inbound_nodes": [[["PatchGAN", 1, 0, {}], ["PatchGAN", 2, 0, {}], ["PatchGAN", 3, 0, {}], ["PatchGAN", 4, 0, {}], ["PatchGAN", 5, 0, {}], ["PatchGAN", 6, 0, {}], ["PatchGAN", 7, 0, {}], ["PatchGAN", 8, 0, {}], ["PatchGAN", 9, 0, {}], ["PatchGAN", 10, 0, {}], ["PatchGAN", 11, 0, {}], ["PatchGAN", 12, 0, {}], ["PatchGAN", 13, 0, {}], ["PatchGAN", 14, 0, {}], ["PatchGAN", 15, 0, {}], ["PatchGAN", 16, 0, {}]]], "config": {"trainable": true, "axis": -1, "name": "concatenate_6"}, "name": "concatenate_6"}, {"class_name": "Dense", "inbound_nodes": [[["concatenate_6", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "units": 2, "use_bias": true, "name": "disc_output", "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax"}, "name": "disc_output"}], "input_layers": [["dist_input0", 0, 0], ["dist_input1", 0, 0], ["dist_input2", 0, 0], ["dist_input3", 0, 0], ["dist_input4", 0, 0], ["dist_input5", 0, 0], ["dist_input6", 0, 0], ["dist_input7", 0, 0], ["dist_input8", 0, 0], ["dist_input9", 0, 0], ["dist_input10", 0, 0], ["dist_input11", 0, 0], ["dist_input12", 0, 0], ["dist_input13", 0, 0], ["dist_input14", 0, 0], ["dist_input15", 0, 0], ["disc_raw_input0", 0, 0], ["disc_raw_input1", 0, 0], ["disc_raw_input2", 0, 0], ["disc_raw_input3", 0, 0], ["disc_raw_input4", 0, 0], ["disc_raw_input5", 0, 0], ["disc_raw_input6", 0, 0], ["disc_raw_input7", 0, 0], ["disc_raw_input8", 0, 0], ["disc_raw_input9", 0, 0], ["disc_raw_input10", 0, 0], ["disc_raw_input11", 0, 0], ["disc_raw_input12", 0, 0], ["disc_raw_input13", 0, 0], ["disc_raw_input14", 0, 0], ["disc_raw_input15", 0, 0]], "name": "DCGAN_discriminator", "output_layers": [["disc_output", 0, 0]]}}], "input_layers": [["DCGAN_input", 0, 0]], "name": "DCGAN", "output_layers": [["model_1", 1, 0], ["DCGAN_discriminator", 1, 0]]}}