{"class_name": "Model", "keras_version": "2.1.5", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "unet_input", "config": {"sparse": false, "batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "name": "unet_input"}}, {"class_name": "Conv2D", "inbound_nodes": [[["unet_input", 0, 0, {}]]], "name": "unet_conv2D_1", "config": {"padding": "same", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "name": "unet_conv2D_1", "kernel_regularizer": null, "filters": 64, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["unet_conv2D_1", 0, 0, {}]]], "name": "leaky_re_lu_1", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "name": "unet_conv2D_2", "config": {"padding": "same", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "name": "unet_conv2D_2", "kernel_regularizer": null, "filters": 128, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["unet_conv2D_2", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"gamma_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "momentum": 0.99, "scale": true, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "leaky_re_lu_2", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_2"}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "name": "unet_conv2D_3", "config": {"padding": "same", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "name": "unet_conv2D_3", "kernel_regularizer": null, "filters": 256, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["unet_conv2D_3", 0, 0, {}]]], "name": "batch_normalization_2", "config": {"gamma_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "momentum": 0.99, "scale": true, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "leaky_re_lu_3", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_3"}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "name": "unet_conv2D_4", "config": {"padding": "same", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "name": "unet_conv2D_4", "kernel_regularizer": null, "filters": 512, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["unet_conv2D_4", 0, 0, {}]]], "name": "batch_normalization_3", "config": {"gamma_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "momentum": 0.99, "scale": true, "epsilon": 0.001}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "activation_1", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "up_sampling2d_1", "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "name": "unet_upconv2D_1", "config": {"padding": "same", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "name": "unet_upconv2D_1", "kernel_regularizer": null, "filters": 128, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["unet_upconv2D_1", 0, 0, {}]]], "name": "batch_normalization_4", "config": {"gamma_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "momentum": 0.99, "scale": true, "epsilon": 0.001}}, {"class_name": "Dropout", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "dropout_1", "config": {"trainable": true, "seed": null, "rate": 0.5, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["dropout_1", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]], "name": "concatenate_1", "config": {"trainable": true, "axis": -1, "name": "concatenate_1"}}, {"class_name": "Activation", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "activation_2", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "up_sampling2d_2", "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_2"}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "name": "unet_upconv2D2", "config": {"padding": "same", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "name": "unet_upconv2D2", "kernel_regularizer": null, "filters": 64, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["unet_upconv2D2", 0, 0, {}]]], "name": "batch_normalization_5", "config": {"gamma_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "momentum": 0.99, "scale": true, "epsilon": 0.001}}, {"class_name": "Dropout", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "dropout_2", "config": {"trainable": true, "seed": null, "rate": 0.5, "name": "dropout_2", "noise_shape": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["dropout_2", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]], "name": "concatenate_2", "config": {"trainable": true, "axis": -1, "name": "concatenate_2"}}, {"class_name": "Activation", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "activation_3", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "up_sampling2d_3", "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_3"}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "name": "unet_upconv2D3", "config": {"padding": "same", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "name": "unet_upconv2D3", "kernel_regularizer": null, "filters": 64, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["unet_upconv2D3", 0, 0, {}]]], "name": "batch_normalization_6", "config": {"gamma_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_6", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "momentum": 0.99, "scale": true, "epsilon": 0.001}}, {"class_name": "Dropout", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "dropout_3", "config": {"trainable": true, "seed": null, "rate": 0.5, "name": "dropout_3", "noise_shape": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["dropout_3", 0, 0, {}], ["unet_conv2D_1", 0, 0, {}]]], "name": "concatenate_3", "config": {"trainable": true, "axis": -1, "name": "concatenate_3"}}, {"class_name": "Activation", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "name": "activation_4", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "up_sampling2d_4", "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_4"}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]], "name": "last_conv", "config": {"padding": "same", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "name": "last_conv", "kernel_regularizer": null, "filters": 3, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}}, {"class_name": "Activation", "inbound_nodes": [[["last_conv", 0, 0, {}]]], "name": "activation_5", "config": {"trainable": true, "name": "activation_5", "activation": "tanh"}}], "input_layers": [["unet_input", 0, 0]], "name": "model_1", "output_layers": [["activation_5", 0, 0]]}}